const updateRecords = [
    {
        version: "1.3.6",
        items: [
            "修复: 暗黑模式favicon图标显示问题",
            "新增: 支持重新获取链接图标",
        ]
    },
    {
        version: "1.3.5",
        items: [
            "新增: 支持根据图片尺寸智能判断壁纸展示方式",
            "新增: 支持任意网页右击收藏到抽屉 （添加列表内）",
            "新增: 火狐浏览器支持",
            "新增: icon图标缓存功能",
            "新增: 首页图标支持拖拽排序",
            "修复: ai搜索偶尔不能正常问题",
        ]
    },
    {
        version: "1.3.1",
        items: [
            "修复: 搜索框选择器功能，支持特殊类型搜索引擎的自动填入和搜索触发",
            "修复：首屏链接浏览器内置链接无法打开问题",
            "修复: 快捷搜索列表显示异常问题"
        ]
    },
    {
        version: "1.3.0",
        items: [
            "新增: 支持豆包、元宝、DeepSeek等直接从搜索发起",
            "优化: 搜索框选择器功能，支持特殊类型搜索引擎的自动填入和搜索触发",
            "优化: 改进链接处理逻辑，将\"链接在当前标签页中打开\"选项改为\"链接在新标签页中打开\"",
            "优化: 增强搜索引擎配置的兼容性和错误处理",
            "优化: 改进搜索结果页的导航体验"
        ]
    },
    {
        version: "1.2.11",
        items: [
            "优化: 添加防抖处理以优化搜索请求",
            "优化: 改进键盘导航支持（上下键切换选项）",
            "修复: 输入框值同步问题",
            "优化: 更新状态管理逻辑，确保更流畅的用户体验"
        ]
    },
    {
        version: "1.2.10",
        items: [
            "修复: webdav教程链接失效问题"
        ]
    },
    {
        version: "1.2.9",
        items: [
            "新增: 任意位置按TAB会focus输入框"
        ]
    },
    {
        version: "1.2.8",
        items: [
            "修复: 壁纸上传问题"
        ]
    },
    {
        version: "1.2.7",
        items: [
            "修复: 快捷搜索跳转icon不显示问题",
            "修复: 搜索下拉框位置问题",
            "修复: 搜索特定字符不生效问题"
        ]
    },
    {
        version: "1.2.6",
        items: [
            "优化: 搜索框为圆角时首页图标也改为圆角"
        ]
    },
    {
        version: "1.2.5",
        items: [
            "修复: 搜索引擎设置排序问题"
        ]
    },
    {
        version: "1.2.4",
        items: [
            "新增: 只是设置暗色模式下壁纸透明度",
            "优化: 抽屉链接改用A标签方式"
        ]
    },
    {
        version: "1.2.3",
        items: [
            "修复: 抽屉默认只选择第一个",
            "优化: 菜单项目",
            "优化: 搜索本地链接数量限制为5个"
        ]
    },
    {
        version: "1.2.2",
        items: [
            "修复: 某些情况下WebDav同步失败的问题"
        ]
    },
    {
        version: "1.2.1",
        items: [
            "修复: 搜索下拉框不显示问题"
        ]
    },
    {
        version: "1.2.0",
        items: [
            "新增: 支持WebDav远端同步",
            "新增: 必应壁纸支持右键下载",
            "优化: 搜索结果页图标展示"
        ]
    },
    {
        version: "1.1.1",
        items: [
            "修复: 暗黑模式下打开页面会闪白问题"
        ]
    },
    {
        version: "1.1.0",
        items: [
            "新增: 暗黑模式",
            "新增: 首屏支持显示时间和日期",
            "新增: 首屏快捷链接支持行数选择",
            "新增: 支持搜索框一直保持水平居中",
            "新增: 支持滚动返回首屏",
            "新增: 搜索框支持按Tab切换搜索源",
            "新增: 支持修改页面标题",
            "修复: 首屏图标排序跟抽屉分组不一致问题",
            "修复: 无法删除自定义搜索源问题"
        ]
    },
    {
        version: "1.0.1",
        items: [
            "修复: 导入数据部分选项不生效问题",
            "修复: 搜索框回车无法跳转问题"
        ]
    },
    {
        version: "1.0.0",
        items: [
            "新增: 搜索支持本地连接搜索",
            "新增: 异常页面增加导出数据按钮",
            "新增: 导航增加数据导出按钮",
            "修复: 测试阶段已知的问题"
        ]
    },
    {
        version: "0.4.1",
        items: [
            "修复: 某些情况下资源展示问题"
        ]
    },
    {
        version: "0.4.0",
        items: [
            "新增：网址拖拽到右下角删除"
        ]
    },
    {
        version: "0.3.0",
        items: [
            "修复：网址URL为空时导致报错问题"
        ]
    },
    {
        version: "0.2.11",
        items: [
            "新增：必应翻译"
        ]
    },
    {
        version: "0.2.10",
        items: [
            "新增：支持添加自定义搜索源",
            "新增：移动分组功能（右击分组标题开启）",
            "修复：新增连接后无法正常编辑问题",
            "修复：第二壁纸显示动效问题"
        ]
    },
    {
        version: "0.2.9",
        items: [
            "新增：数据导入导出功能"
        ]
    },
    {
        version: "0.2.8",
        items: [
            "修复: 0.2.7版本导致的壁纸缓存报错"
        ]
    },
    {
        version: "0.2.7",
        items: [
            "修复: 抽屉导航无法滚动问题"
        ]
    },
    {
        version: "0.2.6",
        items: [
            "优化: 修复第二壁纸显示逻辑",
            "修复: 界面切换搜索下拉框展示问题",
            "修复: 搜索下拉框点击逻辑"
        ]
    },
    {
        version: "0.2.5",
        items: [
            "修复: 必赢壁纸缓存报错问题"
        ]
    },
    {
        version: "0.2.4",
        items: [
            "新增: 新增链接在当前标签页中打开选项"
        ]
    },
    {
        version: "0.2.3",
        items: [
            "新增: 重构关于我界面",
            "新增: 首屏右击增加关于入口",
            "修复: 首屏分组为空时依旧展示黑框问题"
        ]
    },
    {
        version: "0.2.2",
        items: [
            "新增: 默认展示抽屉选项",
            "新增: 搜索框在首屏底部选项",
            "新增: 第二壁纸选项模糊处理",
            "新增: 支持将分组钉在首屏",
            "修复: 便签保存图片间距问题",
            "修复: 首屏滚动触发逻辑",
            "修复: 抽屉分组标题长度问题"
        ]
    },
    {
        version: "0.2.1",
        items: [
            "新增: 缓存必应壁纸",
            "新增: 第二壁纸显示时，隐藏搜索框"
        ]
    },
    {
        version: "0.2.0",
        items: [
            "新增: 便签",
            "修复: 修复了搜索框有文字时且没有Focus时按回车键会跳转搜索的问题",
            "修复: 部分弹窗背景没有高斯模糊的情况",
            "修复: 部分情况下会出现黑边"
        ]
    },
    {
        version: "0.1.7",
        items: [
            "修复: 必应壁纸分辨率调整为4K"
        ]
    },
    {
        version: "0.1.6",
        items: [
            "修复: 首屏第二壁纸显示触发机制（仅在壁纸且鼠标不动的情况下才会触发）"
        ]
    },
    {
        version: "0.1.5",
        items: [
            "新增: 添加按Esc返回首屏的方法",
            "修复: 修复了某些搜索源导致的问题"
        ]
    },
    {
        version: "0.1.4",
        items: [
            "新增: 添加了新的搜索源",
            "修复: 新增链接时灰色块宽度不一致问题"
        ]
    },
    {
        version: "0.1.3",
        items: [
            "新增: 搜索框圆角样式",
            "更新: 首选项Tab样式",
            "修复: 浏览器扩展管理内不显示图标问题",
            "修复: 某些情况下首屏依旧显示新增列表问题"
        ]
    }
];

export default updateRecords;

